app/controllers/items_controller.rb

  def index
    @items = current_user.all_items
    if params[:search]
      @items = Item.search(params[:search]).order("created_at DESC")
    else
      @items = Item.order("created_at DESC")
    end
    @item_markers =  current_user.all_items.map {|item| {lat: item.latitude, long: item.longitude, title: item.title}}.flatten
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 6]]

  def create
    @item = current_user.items.create(item_params)
---
INSERT INTO "items" ("title", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hot Air Balloon"], ["caption", "Rise above"], ["user_id", 2], ["created_at", "2016-01-17 06:42:35.803296"], ["updated_at", "2016-01-17 06:42:35.803296"]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["address", "Africa"], ["latitude", -8.783195], ["longitude", 34.508523], ["updated_at", "2016-01-21 20:09:54.936788"], ["id", 2]]