app/controllers/memories_controller.rb

SELECT "memories".* FROM "memories" WHERE "memories"."user_id" = ?  ORDER BY date ASC  [["user_id", 2]]
---
  def index
    if params[:search]
      @memories = Memory.for_user(current_user).search(params[:search]).order("created_at DESC")
    else
      @memories =  Memory.for_user(current_user).order("created_at DESC")
    end
    @memory_markers =  current_user.all_memories.map {|memory| {lat: memory.latitude, long: memory.longitude, title: memory.title}}.flatten

SELECT  "memories".* FROM "memories" WHERE "memories"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @memory = Memory.find(params[:id])

INSERT INTO "memories" ("title", "caption", "label", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Hi"], ["caption", ""], ["label", ""], ["address", ""], ["user_id", 3], ["created_at", "2016-01-29 21:14:50.210100"], ["updated_at", "2016-01-29 21:14:50.210100"]]
---
  def create
    @memory = current_user.memories.create(memory_params)

UPDATE "memories" SET "label" = ?, "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "memories"."id" = ?  [["label", ""], ["address", "Chiang Mai, Thailand"], ["latitude", 18.787747], ["longitude", 98.99312839999999], ["updated_at", "2016-01-19 18:51:44.222822"], ["id", 3]]
---
  def update
    @memory_markers =  current_user.all_memories.map {|memory| {lat: memory.latitude, long: memory.longitude, title: memory.title}}.flatten
    if @memory.update(memory_params)

DELETE FROM "memories" WHERE "memories"."id" = ?  [["id", 4]]
---
  def destroy
    @memory.destroy

SELECT  "memories".* FROM "memories" WHERE "memories"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_memory
      @memory = Memory.find(params[:id])