app/controllers/plans_controller.rb

  def index
    @plans = current_user.all_plans
    authorize :plan, :index?
    if params[:search]
      @plans = Plan.for_user(current_user).search(params[:search]).order("created_at DESC")
    else
      @plans = Plan.for_user(current_user).order("created_at DESC")
    end
    @plan_markers =  current_user.all_plans.map {|plan| {lat: plan.latitude, long: plan.longitude, title: plan.title}}.flatten
---
SELECT "plans".* FROM "plans" WHERE "plans"."user_id" = ?  [["user_id", 6]]

  def show
    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @plan = current_user.plans.create(plan_params)
---
INSERT INTO "plans" ("title", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First job in the U.S."], ["caption", "Land a job as a junior web developer"], ["user_id", 2], ["created_at", "2016-01-17 06:41:30.685820"], ["updated_at", "2016-01-17 06:41:30.685820"]]

  def update
    authorize(@plan)
    @plan_markers =  current_user.all_plans.map {|plan| {lat: plan.latitude, long: plan.longitude, title: plan.title}}.flatten
    if @plan.update(plan_params)
---
UPDATE "plans" SET "date" = ?, "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["date", "2016-09-01"], ["address", "Manhattan, New York"], ["latitude", 40.7830603], ["longitude", -73.9712488], ["updated_at", "2016-01-21 20:26:01.246109"], ["id", 3]]

  def destroy
    authorize(@plan)
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]